Revit 2027 API
RadialArray.NumMembers Property
Retrieves or changes the number of arrayed members. Array placeholder members in the family environment are not counted.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public override int NumMembers { get; set; }
Public Overrides Property NumMembers As Integer
	Get
	Set
public:
virtual property int NumMembers {
	int get () override;
	void set (int value) override;
}
abstract NumMembers : int with get, set
override NumMembers : int with get, set
Property Value
Int32
See Also
Reference
RadialArray Class
Autodesk.Revit.DB Namespace